package lesson_1

/*
* Пишем логику экрана приложения для интернет-магазина.
*  Представим, что у интернет-магазина было 75 заказов.
*  Нужно продумать релевантные названия и корректно объявить 2 переменные, которые будут содержать:
 – количество заказов,
 – текст с благодарностью за покупку (текст на твое усмотрение).
*  Задай “говорящие” наименования переменных (например, для сторон прямоугольника не a и b, а height и width).
*  Названия переменных должны состоять из нескольких слов. Тип переменных указывать принудительно.
*/

fun main() {

    val numberOfOrders: Int = 75
    val thanksForPurchase: String = "Спасибо за покупку! Будем рады видеть Вас снова."
}